using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace XP
{
    //==============================================================================
// ■ Game_Variables
//------------------------------------------------------------------------------
// 　处理变量的类。编入的是类 Array 的外壳。本类的实例请参考
// Global.game_variables。
//==============================================================================

    public class Game_Variables
    {
        //--------------------------------------------------------------------------
        // ● 初始化
        //--------------------------------------------------------------------------
        public int[] data = new int[5001];
        //--------------------------------------------------------------------------
        // ● 获取变量
        //     variable_id : 变量 ID
        //--------------------------------------------------------------------------
        //--------------------------------------------------------------------------
        // ● 设置变量
        //     variable_id : 变量 ID
        //     value       : 变量的值
        //--------------------------------------------------------------------------

        public int this[int variable_id]
        {
            get
            {
                if (variable_id <= 5000 && this.data[variable_id] != null)
                    return this.data[variable_id];
                else
                    return 0;
            }
            set
            {
                if (variable_id <= 5000)
                    this.data[variable_id] = value;
            }
        }
    }
}
